app/services/account_info.rb

  def get_account_info
    begin
      account = Account.find_by_id(params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]