app/services/user_info.rb

	def get_user_info
		begin
			user = User.find_by_id(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

	def get_accounts
		begin
			accounts = Account.where(user_id: params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ?  [["user_id", 7]]