app/models/user.rb

SELECT "accounts"."id" FROM "accounts" WHERE "accounts"."user_id" = ?  [["user_id", 7]]
---
  def as_json(options = {})
    {
      attributes: {
        id: self.id,
        name: self.name,
        account_ids: self.accounts&.pluck(:id)